//
//  FSJZ_Person.m
//  KenshinPro
//
//  Created by apple on 2019/3/1.
//  Copyright © 2019 Kenshin. All rights reserved.
//

#import "FSJZ_Person.h"

@implementation FSJZ_Person

- (void)fxw_private_function{
    NSLog(@"fxw_private_function");
}
/*
//fxw 科目三 哈哈
 
1、上车，调整座椅，检查 灯光是否关闭、是否挂空档、是否已拉起手刹
2、刷身份证、下车逆时针绕车并触摸车身前后的感应器
3、上车，摸镜子、摸左边前台、摸座位、系安全带
4、发动发动机，准备开始【模拟灯光考试】
 
【模拟灯光考试】
1、所有会车都是[近光灯]
2、超车[远近光灯交替]
3、临时停车[示廓灯、应急灯]
4、道路照明条件不好[远光灯]

 启动车子：
 先才下离合器和刹车
1、[打]打左转向灯
2、[鸣]鸣喇叭
3、[挂]挂一档
4、[放]放手刹
然后慢慢抬起一点离合器，当有一定转速后，松刹车「这里和半坡起步有点像」，然后松离合器，一档驶入。
 
 档位
1档 不得超过20码
2档 不得超过30码
3档 不得超过40码

换挡时必须将【离合器】踩到底

速度快时，换挡后，快速抬起离合器
速度慢时，换挡后，慢慢抬起离合器
 
 【超车】
1、适当加大油门，将速度加速到15码左右，换2挡【慢抬离合】
2、提前打好左转向灯、3秒后变道，且在3秒内加速到3档
3、适当加大油门，将速度加速到22码左右，换3档【快台礼盒】
4、3s后稳住油门速度，变道
5、变道后开启右转向灯、在4秒内加速到接近35码左右的速度变道
6、变道后档车身与低速道平行时，踩下离合器，踩下「不要踩死」刹车减速
7、档速度达到20码时，切换到2档，继续减速，档速度达到15码时，切换到1档，【松刹车、慢抬离合器、关闭转向灯】
 
 【靠边停车】
1、开启右转向灯
2、离合尽量踩死，靠惯性停车，如果速度太慢，可以适当台一点离合
3、车前方中央喷嘴与路边黄线相切
4、当语音播报完靠边停车后：【踩死油门、踩死刹车、空档、手刹】
5、摸镜子、摸左前台、关闭发动机、解开安全带、开关车门、结束考试。
 
 
 轻点刹车：               【人行横道】、【学校区域】、【车站】、【路口左/右转弯】
 轻踩刹车：【会车】、
 鸣喇叭（1-2次），轻踩刹车：【拱桥】、【通过急弯】、
 
 */
@end
